[
  {
    "job_position": "Software Engineer",
    "company": "Google LLC",
    "job_id": "G1234",
    "company_logo": "https://freepngimg.com/download/google/66907-images-logo-google-free-download-png-hd.png",
    "job_type": ["Remote", "Full-time"],
    "location": "Dublin, Ireland",
    "salary": "$150,000 - $200,000",
    "phone": "(123) 456-7890",
    "email": "jobs@google.com",
    "address": "1600 Amphitheatre Parkway, Mountain View, CA 94043",
    "job_description": "The Software Engineer will be responsible for developing, testing, and maintaining software applications. The ideal candidate will have strong programming skills, experience with software development tools and methodologies, and the ability to work in a team environment.",
    "job_responsibilities": "The Software Engineer is responsible for designing and developing software applications using programming languages such as Java, Python, or C#. They will collaborate with cross-functional teams to gather requirements, plan and prioritize projects, and troubleshoot issues. They will test and debug code to ensure that it meets the company's quality standards and document software designs, code, and processes to ensure knowledge transfer and maintainability.",
    "educational_requirements": "BS or MS in Computer Science or a related field.",
    "experiences": "3+ years of experience in software development, with a strong background in programming languages such as Java, Python, or C++."
  },
  {
    "job_position": "Front-end Developer",
    "company": "Meta Inc",
    "job_id": "GOOGL1357",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Meta-Logo.png/2560px-Meta-Logo.png",
    "job_type": ["On-Site", "Full-time"],
    "location": "NewYork, USA",
    "salary": "$100,000 - $130,000",
    "phone": "(123) 456-7890",
    "email": "jobs@google.com",
    "address": "1600 Amphitheatre Parkway, Mountain View, CA 94043",
    "job_description": "The Front End Developer will be responsible for developing and implementing user-friendly web applications. The ideal candidate will have strong skills in HTML, CSS, and JavaScript, experience with responsive design, and a strong understanding of UI/UX principles.",
    "job_responsibilities": "The Front End Developer is responsible for developing user-friendly web applications using HTML, CSS, and JavaScript. They will implement responsive design to ensure that applications are optimized for different devices and screen sizes and collaborate with UI/UX designers to ensure that applications are visually appealing and easy to use. They will test and debug code to ensure that it meets the company's quality standards",
    "educational_requirements": "BS or MS in Computer Science, Engineering, or a related field.",
    "experiences": "3+ years of experience in front-end web development, with experience in HTML, CSS, JavaScript, and JavaScript frameworks such as React or Angular, and knowledge of web standards and accessibility guidelines."
  },

  {
    "job_position": "Product Manager",
    "company": "Amazon",
    "job_id": "A5678",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Amazon_logo.svg/2560px-Amazon_logo.svg.png",
    "job_type": ["On-Site", "Part-time"],
    "location": "Seattle, WA",
    "salary": "$120,000 - $150,000",
    "phone": "(123) 456-7890",
    "email": "jobs@amazon.com",
    "address": "410 Terry Ave N, Seattle, WA 98109",
    "job_description": "The Product Manager will be responsible for developing and implementing the company's product strategy. The ideal candidate will have experience in product management, excellent communication skills, and the ability to work collaboratively with cross-functional teams",
    "job_responsibilities": "The Product Manager is responsible for developing and implementing the company's product strategy, including product roadmaps, pricing, and go-to-market plans. They will collaborate with cross-functional teams to gather requirements, prioritize projects, and ensure that products are delivered on time and within budget. The Product Manager will conduct market research and gather customer feedback to identify customer needs and preferences",
    "educational_requirements": "BS or MS in Computer Science, Engineering, or a related field.",
    "experiences": "5+ years of experience in product management, with a proven track record of successfully launching and scaling products."
  },
  {
    "job_position": "Marketing Specialist",
    "company": "Apple Inc",
    "job_id": "APPL9012",
    "company_logo": "https://www.pngmart.com/files/10/Apple-Logo-PNG-Photos.png",
    "job_type": ["On-Site", "Full-time"],
    "location": "Cupertino, CA",
    "salary": "$80,000 - $100,000",
    "phone": "(123) 456-7890",
    "email": "jobs@apple.com",
    "address": "One Apple Park Way, Cupertino, CA 95014",
    "job_description": "The Marketing Specialist will be responsible for developing and executing marketing campaigns to promote the company's products and services. The ideal candidate will have a strong understanding of marketing concepts, experience in social media marketing, and excellent communication skills.",
    "job_responsibilities": "The Marketing Specialist is responsible for developing and executing marketing campaigns across multiple channels, such as social media, email, and advertising. They will monitor and analyze marketing metrics to measure the effectiveness of campaigns and identify areas for improvement. The Marketing Specialist will collaborate with cross-functional teams to develop marketing content,a.",
    "educational_requirements": "Bachelor's degree in Marketing, Communications, or a related field.",
    "experiences": "3+ years of experience in marketing, with a proven track record of developing and executing successful campaigns."
  },
  {
    "job_position": "Embedded Software Engineer",
    "company": "Intel",
    "job_id": "INTL123",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Intel_logo_%282006-2020%29.svg/800px-Intel_logo_%282006-2020%29.svg.png",
    "job_type": ["On-Site", "Part-time"],
    "location": "Santa Clara, CA",
    "salary": "$120,000 - $150,000",
    "phone": "(123) 456-7890",
    "email": "jobs@intel.com",
    "address": "2200 Mission College Blvd, Santa Clara, CA 95054",
    "job_description": "The Embedded Software Engineer will be responsible for designing and developing software for embedded systems. The ideal candidate will have strong skills in C/C++, experience with microcontrollers, and the ability to work collaboratively with hardware engineers..",
    "job_responsibilities": "The Embedded Software Engineer is responsible for designing and developing software for embedded systems using programming languages such as C/C++. They will collaborate with hardware engineers to ensure that software and hardware are compatible and work seamlessly together. They will test and debug code to ensure that it meets the company's quality standards and document software designs, code.",
    "educational_requirements": "BS or MS in Computer Science, Electrical Engineering, or a related field.",
    "experiences": "5+ years of experience in embedded software development, with a strong background in C and C++ programming, experience with real-time operating systems, and familiarity with hardware design and debug tools."
  },
  {
    "job_position": "Quality Assurance Analyst",
    "company": "IBM Corp.",
    "job_id": "IBM6789",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/IBM_logo.svg/2560px-IBM_logo.svg.png",
    "job_type": ["Remote", "Full-time"],
    "location": "Armonk, NY",
    "salary": "$80,000 - $100,000",
    "phone": "(123) 456-7890",
    "email": "jobs@ibm.com",
    "address": "1 New Orchard Road, Armonk, NY 10504",
    "job_description": "The Quality Assurance Analyst will be responsible for testing software applications to ensure that they meet the company's quality standards. The ideal candidate will have experience in software testing methodologies, excellent problem-solving skills, and the ability to work collaboratively with development teams.",
    "job_responsibilities": "The Quality Assurance Analyst is responsible for developing and executing test plans to ensure that software applications meet the company's quality standards. They will collaborate with development teams to troubleshoot and resolve issues and develop and maintain automated test scripts to improve testing efficiency and effectiveness. The Quality Assurance Analyst will monitor and analyze testing metrics to measure the effectiveness of testing and identify areas for improvement.",
    "educational_requirements": "BS or MS in Computer Science, Engineering, or a related field.",
    "experiences": "3+ years of experience in software quality assurance, with experience in test automation, knowledge of testing methodologies and techniques, and experience working with Agile development methodologies."
  },
  {
    "job_position": "Data Scientist",
    "company": "Microsoft",
    "job_id": "MSFT2468",
    "company_logo": "https://cdn.cdnlogo.com/logos/m/6/microsoft.svg",
    "job_type": ["Remote", "Full-time"],
    "location": "Redmond, WA",
    "salary": "$120,000 - $160,000",
    "phone": "(123) 456-7890",
    "email": "jobs@microsoft.com",
    "address": "1 Microsoft Way, Redmond, WA 98052",
    "job_description": "The Data Scientist will be responsible for analyzing large amounts of data to identify trends and insights that can be used to inform business decisions. The ideal candidate will have strong skills in data analysis, machine learning, and statistical modeling, as well as the ability to communicate findings to non-technical stakeholders.",
    "job_responsibilities": "The Data Scientist is responsible for analyzing large amounts of data using statistical modeling, machine learning, and data visualization tools. They will collaborate with cross-functional teams to identify business problems and opportunities that can be addressed with data analysis. The Data Scientist will develop predictive models and algorithms to improve business decision-making.",
    "educational_requirements": "MS or PhD in Computer Science, Statistics, Mathematics, or a related field.",
    "experiences": "5+ years of experience in data analysis and machine learning, with experience in data modeling, programming skills in Python or R, and experience with deep learning frameworks such as TensorFlow or PyTorch."
  },
  {
    "job_position": "Senior Software Engineer",
    "company": "Google LLC",
    "job_id": "G1764",
    "company_logo": "https://freepngimg.com/download/google/66907-images-logo-google-free-download-png-hd.png",
    "job_type": ["On-Site", "Full-time"],
    "location": "Dublin, Ireland",
    "salary": "$180,000 - $220,000",
    "phone": "(123) 456-7890",
    "email": "jobs@google.com",
    "address": "1600 Amphitheatre Parkway, Mountain View, CA 94043",
    "job_description": "The Senior Software Engineer will be responsible for developing, testing, and maintaining software applications. The ideal candidate will have strong programming skills, experience with software development tools and methodologies, and the ability to work in a team environment.",
    "job_responsibilities": "The Senior Software Engineer is responsible for designing and developing software applications using programming languages such as Java, Python, or C#. They will collaborate with cross-functional teams to gather requirements, plan and prioritize projects, and troubleshoot issues. They will test and debug code to ensure that it meets the company's quality standards and document software designs, code, and processes to ensure knowledge transfer and maintainability.",
    "educational_requirements": "BS or MS in Computer Science or a related field.",
    "experiences": "5+ years of experience in software development, with a strong background in programming languages such as Java, Python, or C++."
}

]
